// pages/kno/kno.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list1: [
      ['什么是天气', '天气是指短时间(几分钟到几天)发生的气bai象现象,如雷雨、冰雹、台风、寒潮、大风等。'],
      ['为什么冬天的气压比夏天高', '气压是指地球上空气柱在单位面积上产生的压力。一个地方的气压是经常发生变化的，当气压降低时，天气阴雨，气象升高时，天气转晴。气压发生变化有许多原因。其中空气温度的变化是引起气压变化的一个很重要的原因。当空气冷却时，空气收缩，密度增大，单位面积上承受的空气柱重量增加，气压也就升高。因此，冷空气一到，总是伴随着气压的升高;而在暖空气来临的同时，气压常常降压。冬天是冷空气的世界，夏季则是暖空气的天地，气压冬高夏低的道理也就很清楚了。'],
      ['什么是数值天气预报', '数值预报是根据现有的天气状况和已知的初始条件，利用高速计算机，求解控制大气运动的动力-热力学方程，从而得出一段时期内的天气形势和有关气象要素的客观定量预报方法。数值天气预报是当今天气预报的基础，也是气象现代化建设的重要标志之一。'],
      ['气候预报', '指利用气候演变规律制作的预报。制作方法与“长期天气预报”相似。它是从气候演变规律出发预报未来一段时期内可能出现的天气状况。'],
      ['气候异常', '正常气候起伏中出现的明显反常现象。主要由气候因子的配置发生较大变化所致。常导致人类及动植物的不相适应，而影响人类社会活动及生产活动，危及动植物的正常生长发育等。'],
      ['城市气候', ' 在大气候或区域气候的背景条件下，由于城市化的影响而形成的一种局地气候或小气候。城市气候呈现出所谓“五岛”的特征，即“热岛”、“湿岛”、“干岛”、“雨岛”、“混浊岛”。']
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})